In [1]:
# Step 1: Import libraries

import pandas as pd
import numpy as np
import random

In [2]:
# Step 2: Adam Nevill books dataset

books = [
    "Banquet for the Damned",
    "Apartment 16",
    "The Ritual",
    "Last Days",
    "House of Small Shadows",
    "No One Gets Out Alive",
    "Lost Girl",
    "Under a Watchful Eye",
    "The Reddening",
    "Cunning Folk",
    "The Vessel",
    "All the Fiends of Hell",
    "Monumental"
]

prices = np.random.uniform(8, 20, len(books)).round(2)

books_df = pd.DataFrame({
    "Book": books,
    "Price (£)": prices
})

books_df

                      Book  Price (£)
0   Banquet for the Damned      14.28
1             Apartment 16      13.17
2               The Ritual      17.62
3                Last Days      12.84
4   House of Small Shadows      17.00
5    No One Gets Out Alive       9.40
6                Lost Girl      17.41
7     Under a Watchful Eye      17.73
8            The Reddening      19.56
9             Cunning Folk      13.34
10              The Vessel      12.76
11  All the Fiends of Hell      17.84
12              Monumental       9.13

In [3]:
# Step 3: Bookstore dataset

bookstores = ["Waterstones", "WHSmith"]

stores_df = pd.DataFrame({
    "Store": bookstores,
    "Number_of_Stores": [300, 600],
    "Avg_Customers_Per_Day": [850, 650],
    "Profit_Margin": [0.35, 0.25]
})

stores_df

         Store  Number_of_Stores  Avg_Customers_Per_Day  Profit_Margin
0  Waterstones               300                    850           0.35
1      WHSmith               600                    650           0.25

In [4]:
# Step 4: Customer demographics

demographics = pd.DataFrame({
    "Age_Group": ["18-24", "25-34", "35-44", "45-54", "55+"],
    "Percent": [25, 35, 20, 12, 8],
    "Main_Genre": ["Horror", "Horror", "Horror", "Thriller", "Classic Horror"]
})

demographics

  Age_Group  Percent      Main_Genre
0     18-24       25          Horror
1     25-34       35          Horror
2     35-44       20          Horror
3     45-54       12        Thriller
4       55+        8  Classic Horror

In [5]:
# Step 5: Weekly sales simulation

purchase_rate = 0.10
avg_price = books_df["Price (£)"].mean()

weekly_sales = []

for index, row in stores_df.iterrows():
    
    customers_week = row["Avg_Customers_Per_Day"] * 7
    books_sold = customers_week * purchase_rate
    
    revenue = books_sold * avg_price
    profit = revenue * row["Profit_Margin"]
    
    weekly_sales.append({
        "Store": row["Store"],
        "Weekly_Revenue (£)": round(revenue, 2),
        "Weekly_Profit (£)": round(profit, 2)
    })

weekly_df = pd.DataFrame(weekly_sales)

weekly_df

         Store  Weekly_Revenue (£)  Weekly_Profit (£)
0  Waterstones             8791.35            3076.97
1      WHSmith             6722.80            1680.70

In [6]:
# Step 6: yearly profit

weekly_df["Yearly_Revenue (£)"] = weekly_df["Weekly_Revenue (£)"] * 52
weekly_df["Yearly_Profit (£)"] = weekly_df["Weekly_Profit (£)"] * 52

weekly_df

,Store,Weekly_Revenue (£),Weekly_Profit (£),Yearly_Revenue (£),Yearly_Profit (£)
0,Waterstones,8791.35,3076.97,457150.2,160002.44
1,WHSmith,6722.80,1680.70,349585.6,87396.40

In [7]:
# Step 7: national scale

national_data = []

for index, row in weekly_df.iterrows():
    
    store_count = stores_df.loc[stores_df["Store"] == row["Store"], "Number_of_Stores"].values[0]
    
    national_revenue = row["Yearly_Revenue (£)"] * store_count
    national_profit = row["Yearly_Profit (£)"] * store_count
    
    national_data.append({
        "Store": row["Store"],
        "Total UK Revenue (£)": round(national_revenue),
        "Total UK Profit (£)": round(national_profit)
    })

national_df = pd.DataFrame(national_data)

national_df

         Store  Total UK Revenue (£)  Total UK Profit (£)
0  Waterstones             137145060             48000732
1      WHSmith             209751360             52437840

In [8]:
comparison = pd.DataFrame({

    "Store": ["Waterstones", "WHSmith"],

    "Business_Model": [
        "Book specialist, curated experience",
        "Mixed retail (books, magazines, travel retail)"
    ],

    "Customer_Type": [
        "Serious readers, collectors, students",
        "Travelers, casual readers"
    ],

    "Profit_Strategy": [
        "Higher margin books, loyalty customers",
        "High volume, impulse purchases"
    ]

})

comparison

,Store,Business_Model,Customer_Type,Profit_Strategy
0,Waterstones,"Book specialist, curated experience","Serious readers, collectors, students","Higher margin books, loyalty customers"
1,WHSmith,"Mixed retail (books, magazines, travel retail)","Travelers, casual readers","High volume, impulse purchases"

In [9]:
# Final dataset merge

final_dataset = weekly_df.merge(
    national_df,
    on="Store"
)

final_dataset

,Store,Weekly_Revenue (£),Weekly_Profit (£),Yearly_Revenue (£),Yearly_Profit (£),Total UK Revenue (£),Total UK Profit (£)
0,Waterstones,8791.35,3076.97,457150.2,160002.44,137145060,48000732
1,WHSmith,6722.80,1680.70,349585.6,87396.40,209751360,52437840

In [10]:
# Save to CSV

final_dataset.to_csv("adam_nevill_bookstore_analysis.csv", index=False)